labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  }    
}

/****************************************************************
*FUNCTION NAME:setAtMode
*FUNCTION     :setAtMode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setAtMode(void)
{
  delay_ms(1000);       // prerequisite for switching to At Command Mode
  sim800c.sendAtCommand("+++\r\n",200, 0);
  delay_ms(1000);     // prerequisite for switching to At Command Mode
  debugTerminal("setAtMode");
}

/****************************************************************
*FUNCTION NAME:setDataMode
*FUNCTION     :setDataMode
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setDataMode(void)
{
  sim800c.sendAtCommand("ATO\r\n",200, 0);
  debugTerminal("setDataMode");
}

/****************************************************************
*FUNCTION NAME:setActiveProfile
*FUNCTION     :setActiveProfile
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setActiveProfile(void)
{
}

/****************************************************************
*FUNCTION NAME:setDefaultConfig
*FUNCTION     :setDefaultConfig
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setDefaultConfig(void)
{
  sim800c.sendAtCommand("ATZ\r\r",200, 0);

  debugTerminal("setDefaultConfig");
}

/****************************************************************
*FUNCTION NAME:setFactoryDefault
*FUNCTION     :setFactoryDefault
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setFactoryDefault(void)
{
  sim800c.sendAtCommand("AT&F0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

}

/****************************************************************
*FUNCTION NAME:setAtEcho
*FUNCTION     :change command echo mode
*INPUT        :turnon
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setAtEcho(bool turnon)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "ATE%d\r\n", turnon); 
  sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setAtEcho");//need to check as response changes can be on or off

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer)); 

}

/****************************************************************
*FUNCTION NAME:setBaudRate
*FUNCTION     :AT command to change baud rate
*INPUT        :baudrate
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setBaudRate(uint16_t baudrate)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+IPR=%d\r\n", baudrate); 
  sim800c.sendAtCommand(temp, 200, 0);

  debugTerminal("Sim80x_setBaudRate");

  memset(Sim80x.AtCommand.SendCommand,0,sizeof(Sim80x.AtCommand.SendCommand)); 
}

/****************************************************************
*FUNCTION NAME:setPower
*FUNCTION     :setPower
*INPUT        :turnon
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::setPower(bool turnon)
{ 
  if(turnon==true)
  {  
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      delay_ms(100);
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=1;
      //initValue();
    }
    else
    {     
      #if (_SIM80X_USE_POWER_KEY==1)  
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      delay_ms(3000);  
      if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
      {
        delay_ms(10000);
        #if (_SIM80X_DEBUG==1)
        printf("\r\nSim80x_SetPower(ON) ---> OK\r\n");
        #endif
        Sim80x.Status.Power=1;
        //initValue();   
      }
      else
        Sim80x.Status.Power=0;
    }
  }
  else
  {
    if(sim800c.sendAtCommand("AT\r\n",200,1,"AT\r\r\nOK\r\n") == 1)
    {
      #if (_SIM80X_DEBUG==1)
      printf("\r\nSim80x_SetPower(OFF) ---> OK\r\n");
      #endif
      Sim80x.Status.Power=0;
      #if (_SIM80X_USE_POWER_KEY==1) 
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_RESET);
      delay_ms(1200);
      GPIO_WriteBit(GSM_GPIO_PWR,GSM_PIN_PWR,Bit_SET);
      #endif
      #if (_SIM80X_USE_POWER_KEY==0)
      sim800c.sendAtCommand("AT+CPOWD=1\r\n",2000,1,"\r\nOK\r\n"); 
      #endif      
    }
  }  
}

/****************************************************************
*FUNCTION NAME:saveParameters
*FUNCTION     :saveParameters
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void   LIB_SIM800C::setParameters(void)
{
  sim800c.sendAtCommand("AT&W0\r\n",200,1,"AT&W0\r\r\nOK\r\n");
  debugTerminal("setParameters()");

  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
}

/****************************************************************
*FUNCTION NAME:getManNo
*FUNCTION     :getManNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getManNo(void)
{
  sim800c.sendAtCommand("AT+CGMI\r\n",200,0);

  debugTerminal("Sim80x_getManNo");

  //update
  
  
  
}

/****************************************************************
*FUNCTION NAME:getModelNo
*FUNCTION     :getModelNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getModelNo(void)
{
  sim800c.sendAtCommand("AT+CGMM\r\n",200,0);

  debugTerminal("Sim80x_getModelNo");

  //update
  

  
