labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:getGlobalNo
*FUNCTION     :getGlobalNo 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getGlobalNo(void)
{
  sim800c.sendAtCommand("AT+GOI\r\n",200,0);

  debugTerminal("Sim80x_getGlobalNo");

  //update
  

  
}

/****************************************************************
*FUNCTION NAME:getLastCommand
*FUNCTION     :getLastCommand 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getLastCommand(void)
{
   sim800c.sendAtCommand("A/",200, 0);
   //RESPONSE CANT BE DETERMINED
}

/****************************************************************
*FUNCTION NAME:getCurrentConfig
*FUNCTION     :getCurrentConfig 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getCurrentConfig(void)
{
  sim800c.sendAtCommand("AT&V0\r\n",200,0);

  debugTerminal("Sim80x_setFactoryDefault");

  //update
  

  
}

/****************************************************************
*FUNCTION NAME:getTaCapabilities
*FUNCTION     :getTaCapabilities 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getTaCapabilities(void)
{
  sim800c.sendAtCommand("AT+GCAP\r\n",200,0);

  debugTerminal("Sim80x_getTaCapabilities");

  //update
  

}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :IMEI
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getIMEI(char *IMEI)
{
  sim800c.sendAtCommand("AT+CGSN\r\n",200, 0);

  processIMEI(1);
}

/****************************************************************
*FUNCTION NAME:getTeChar
*FUNCTION     :getTeChar 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getTeChar(void)
{
  sim800c.sendAtCommand("AT+CSCS?\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getIMEI
*FUNCTION     :recieve module IMEI number 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getAddrsType(void)
{


  sim800c.sendAtCommand("AT+CSTA?\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getIMSI
*FUNCTION     :getIMSI 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getIMSI(void)
{


  sim800c.sendAtCommand("AT+CIMI\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getSelOperator
*FUNCTION     :getSelOperator
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getOperator(void)
{


  sim800c.sendAtCommand("AT+COPS?\r\n",120000, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getNetworkReg
*FUNCTION     :getNetworkReg 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getNetworkReg(void)
{


  sim800c.sendAtCommand("AT+CREG?\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getRLPParams
*FUNCTION     :getRLPParams
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::getRLPParams(void)
{
  sim800c.sendAtCommand("AT+CRLP?\r\n",200, 0);
  debugTerminal("setRLPParams");
}

/****************************************************************
*FUNCTION NAME:getCSQ
*FUNCTION     :getCSQ 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getCSQ(void)
{


  sim800c.sendAtCommand("AT+CSQ\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getPrefOperLst
*FUNCTION     :getPrefOperLst 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getPrefOperLst(void)
{


  sim800c.sendAtCommand("AT+CPOL?\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getOperName
*FUNCTION     :getOperName 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getOperName(void)
{


  sim800c.sendAtCommand("AT+COPN\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getPhoneFunc
*FUNCTION     :getPhoneFunc 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getPhoneFunc(void)
{


  sim800c.sendAtCommand("AT+CFUN?\r\n",10000, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:getClockData
*FUNCTION     :getClockData
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::getClockData(void)
{
  sim800c.sendAtCommand("AT+CCLK?\r\n",200, 0);
  debugTerminal("setClockData");
}

/****************************************************************
*FUNCTION NAME:getBattChar
*FUNCTION     :getBattChar 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool  LIB_SIM800C::getBattChar(void)
{


  sim800c.sendAtCommand("AT+CBC\r\n",200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:setTeChar
*FUNCTION     :setTeChar
*INPUT        :void
*OUTPUT       :void
****************************************************************/
bool LIB_SIM800C::setTeChar(char *chset)
{
  bool sucess;
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CSCS%s\r\n", chset);
  sucess = sim800c.sendAtCommand(temp, 200, 0);
  debugTerminal("setTeChar");

  return sucess;
}

/****************************************************************
*FUNCTION NAME:setAddrsType
*FUNCTION     :setAddrsType
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setAddrsType(uint8_t type)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CSTA=%d\r\n", type); 
  sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setAddrsType");
}

/****************************************************************
*FUNCTION NAME:setSelOperator
*FUNCTION     :setSelOperator
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setSelOperator(uint8_t mode, uint8_t format, uint8_t oper)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+COPS=%d,[%d[],%d]]\r\n", mode, format, oper); 
  sim800c.sendAtCommand(temp,120000, 0);
  debugTerminal("setSelOperator");
}

/****************************************************************
*FUNCTION NAME:setNetworkReg
*FUNCTION     :setNetworkReg
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setNetworkReg(bool turnon)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CREG=%d\r\n", turnon); 
  sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setNetworkReg");
  processNetworkReg(1);
}

/****************************************************************
*FUNCTION NAME:setRLPParams
*FUNCTION     :setRLPParams 
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void  LIB_SIM800C::setRLPParams(uint16_t iws,uint16_t mws,uint16_t t2,uint16_t n2,uint16_t t4)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CRLP=%d[,%d[,%d[,%d[,%d]]]]\r\n", iws, mws, t2, n2, t4); 


  sim800c.sendAtCommand(temp,200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:setPrefOperLst
*FUNCTION     :setPrefOperLst
*INPUT        :void
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setPrefOperLst(uint8_t index, uint8_t  format, char *oper)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CPOL=%d[,%d,%s]\r\n", index, format, oper); 
  sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setPrefOperLst");
}

/****************************************************************
*FUNCTION NAME:setPhoneFunc
*FUNCTION     :setPhoneFunc
*INPUT        :fun, rst
*OUTPUT       :void
****************************************************************/
void LIB_SIM800C::setPhoneFunc(uint8_t fun, uint8_t  rst)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CFUN=%d[,%d]\r\n", fun, rst); 
  sim800c.sendAtCommand(temp,10000, 0);
  debugTerminal("setPhoneFunc");
}

/****************************************************************
*FUNCTION NAME:setClockData
*FUNCTION     :setClockData 
*INPUT        :void
*OUTPUT       :time
****************************************************************/
void  LIB_SIM800C::setClockData(char time)
{
  char temp[40];
  snprintf(temp, sizeof(temp), "AT+CCLK=%s\r\n", time); 
  sim800c.sendAtCommand(temp,200, 0);

  //update
}

/****************************************************************
*FUNCTION NAME:setSimAccess
*FUNCTION     :setSimAccess
*INPUT        :void
*OUTPUT       :length, command
****************************************************************/
void LIB_SIM800C::setSimAccess(uint16_t length, char command)
{
  char temp[20];
  snprintf(temp, sizeof(temp), "AT+CSIM=%d,%s\r\n", length, command); 
  sim800c.sendAtCommand(temp,200, 0);
  debugTerminal("setSimAccess");
}



/****************************************************************
*FUNCTION NAME:processManNo
*FUNCTION     :processManNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processManNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGMI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGMI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
