labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
  debugTerminal("Sim80x_getManNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processModelNo
*FUNCTION     :processModelNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processModelNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+CGMM\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+CGMM\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getModelNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}//complete

/****************************************************************
*FUNCTION NAME:processGlobalNo
*FUNCTION     :processGlobalNo
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processGlobalNo(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GOI\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GOI\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getGlobalNo");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processLastCommand
*FUNCTION     :processLastCommand
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processLastCommand(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"A/\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"A/\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getLastCommand");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processCurrentConfig
*FUNCTION     :processCurrentConfig
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processCurrentConfig(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT&V0\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT&V0\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getCurrentConfig");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processTaCapabilities(uint16_t addrs)
{	
	char      *strStart,*str1;
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
     
  str1 = strstr(strStart,"AT+GCAP\r\r\n");
  
  if(str1!=NULL)
    sscanf(str1,"AT+GCAP\r\r\n%s",Sim80x.IMEI);

  // update Flash IC here
		
  debugTerminal("Sim80x_getTaCapabilities");
  
  memset(Sim80x.UsartRxBuffer,0,sizeof(Sim80x.UsartRxBuffer));
	
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
bool LIB_SIM800C::processNetworkReg(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processCSQ(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  str1 = strstr(strStart,"\r\n+CREG:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,',');
    str1++;
    if(atoi(str1)==1)
      Sim80x.Status.RegisterdToNetwork=1;
    else
      Sim80x.Status.RegisterdToNetwork=0;
  }
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processCBC(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################
  str1 = strstr(strStart,"\r\n+CBC:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    tmp_int32_t = atoi(str1);
    if(tmp_int32_t==0)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==1)
    {
      Sim80x.Status.BatteryCharging=1;
      Sim80x.Status.BatteryFull=0;
    }
    if(tmp_int32_t==2)
    {
      Sim80x.Status.BatteryCharging=0;
      Sim80x.Status.BatteryFull=1;
    }
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryPercent = atoi(str1);
    str1 = strchr(str1,',');
    str1++;
    Sim80x.Status.BatteryVoltage = atof(str1)/1000;      
  }
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgTxt(char *number, char *msg, uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################  
  str1 = strstr(strStart,"\r\n+CMGS:");
  if(str1!=NULL)
  {
    Sim80x.Gsm.MsgSent=1;
  }  
 
