labved/NODEBOX-RF868_STM32LDISCO/USER/LIB/LIB_SIM800C/LIB_SIM800C.cpp
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgMemorySts(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
//##################################################  
  str1 = strstr(strStart,"\r\n+CPMS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    str1++;
    if(*str1 == '"')
    {
      str1 = strchr(str1,',');
      str1++;
    }
    Sim80x.Gsm.MsgUsed = atoi(str1);
    str1 = strchr(str1,',');
    str1++;      
    Sim80x.Gsm.MsgCapacity = atoi(str1);
  }  
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsg(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CMGR:");
  if(str1!=NULL)
  {
    if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_Text)
    {
      memset(Sim80x.Gsm.Msg,0,sizeof(Sim80x.Gsm.Msg));
      memset(Sim80x.Gsm.MsgDate,0,sizeof(Sim80x.Gsm.MsgDate));
      memset(Sim80x.Gsm.MsgNumber,0,sizeof(Sim80x.Gsm.MsgNumber));
      memset(Sim80x.Gsm.MsgTime,0,sizeof(Sim80x.Gsm.MsgTime));
      tmp_int32_t = sscanf(str1,"\r\n+CMGR: %*[^,],\"%[^\"]\",%*[^,],\"%[^,],%[^+-]%*d\"\r\n%[^\r]s\r\nOK\r\n",Sim80x.Gsm.MsgNumber,Sim80x.Gsm.MsgDate,Sim80x.Gsm.MsgTime,Sim80x.Gsm.Msg);      
      if(tmp_int32_t == 4)
        Sim80x.Gsm.MsgReadIsOK=1;
      else
        Sim80x.Gsm.MsgReadIsOK=0;
    }else if(Sim80x.Gsm.MsgFormat == GsmMsgFormat_PDU)
    {

      
    }    
  

}
}
/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsMsgServiceNo(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
 //##################################################  
  str1 = strstr(strStart,"\r\n+CSCA:");
  if(str1!=NULL)
  {
    memset(Sim80x.Gsm.MsgServiceNumber,0,sizeof(Sim80x.Gsm.MsgServiceNumber));
    str1 = strchr(str1,'"');
    str1++;
    str2 = strchr(str1,'"');
    strncpy(Sim80x.Gsm.MsgServiceNumber,str1,str2-str1);
  }
 
}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processSmsTextModeParam(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //##################################################  
  str1 = strstr(strStart,"\r\n+CSMP:");
  if(str1!=NULL)
  {
    tmp_int32_t = sscanf(str1,"\r\n+CSMP: %hhd,%hhd,%hhd,%hhd\r\nOK\r\n",&Sim80x.Gsm.MsgTextModeParameterFo,&Sim80x.Gsm.MsgTextModeParameterVp,&Sim80x.Gsm.MsgTextModeParameterPid,&Sim80x.Gsm.MsgTextModeParameterDcs);
  }
 

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTGetHostName(uint16_t addrs)
{
  
  char      *strStart,*str1,*str2,*str3;
  int32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0];  
  //################################################## 
  str1 = strstr(strStart,"\r\n+BTHOST:");
  if(str1!=NULL)
  {
    sscanf(str1,"\r\n+BTHOST: %[^,],%[^\r]",Sim80x.Bluetooth.HostName,Sim80x.Bluetooth.HostAddress);    
  }  
  

}

/****************************************************************
*FUNCTION NAME:processTaCapabilities
*FUNCTION     :processTaCapabilities
*INPUT        :addrs; 
*OUTPUT       :bool
****************************************************************/
void LIB_SIM800C::processBTStatus(uint16_t addrs)
{
  
  char      *strStart, *str1, *str2, *str3;
  uint32_t   tmp_int32_t;
  char      tmp_str[16];
  
  strStart = (char*)&Sim80x.UsartRxBuffer[0]; 
  //##################################################  
  str1 = strstr(strStart,"\r\n+BTSTATUS:");
  if(str1!=NULL)
  {
    str1 = strchr(str1,':');
    str1++;
    Sim80x.Bluetooth.Status = (BluetoothStatus_t)atoi(str1);
    
    str3 = strstr(str1,"\r\nOK\r\n");
    CheckAnotherConnectedProfile:
    str2 = strstr(str1,"\r\nC:");
    if((str2 != NULL) && (str2 <str3) && (str2 > str1))
    {
      tmp_int32_t = sscanf(str2,"\r\nC: %hhd,%[^,],%[^,],%[^\r]",&Sim80x.Bluetooth.ConnectedID,Sim80x.Bluetooth.ConnectedName,Sim80x.Bluetooth.ConnectedAddress,tmp_str);       
      if(strcmp(tmp_str,"\"HFP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"HSP\"")==0)
        tmp_int32_t = BluetoothProfile_HSP_HFP;
      else if(strcmp(tmp_str,"\"A2DP\"")==0)
        tmp_int32_t = BluetoothProfile_A2DP;
      else if(strcmp(tmp_str,"\"GAP\"")==0)
        tmp_int32_t = BluetoothProfile_GAP;
      else if(strcmp(tmp_str,"\"GOEP\"")==0)
        tmp_int32_t = BluetoothProfile_GOEP;
      else if(strcmp(tmp_str,"\"OPP\"")==0)
        tmp_int32_t = BluetoothProfile_OPP;
      else if(strcmp(tmp_str,"\"SDAP\"")==0)
        tmp_int32_t = BluetoothProfile_SDAP;
      else if(strcmp(tmp_str,"\"SPP\"")==0)
        tmp_int32_t = BluetoothProfile_SSP;
      else tmp_int32_t = BluetoothProfile_NotSet;
    
      for(uint8_t i=0 ;i<sizeof(Sim80x.Bluetooth.ConnectedProfile) ; i++)
      {
        if(Sim80x.Bluetooth.ConnectedProfile[i]==(BluetoothProfile_t)tmp_int32_t)
          break;
        if(Sim80x.Bluetooth.ConnectedProfile[i]==BluetoothProfile_NotSet)
        {
          Sim80x.Bluetooth.ConnectedProfile[i]=(BluetoothProfile_t)tmp_int32_t;
          break;
        }
      }
      str1+=5;
      goto CheckAnotherConnectedProfile;
    }    
  }  
   

